       01 RAYLIB_KEY_NULL            PIC 9(03) COMP-5 VALUE 0.          
       01 RAYLIB_KEY_APOSTROPHE      PIC 9(03) COMP-5 VALUE 39.         
       01 RAYLIB_KEY_COMMA           PIC 9(03) COMP-5 VALUE 44.         
       01 RAYLIB_KEY_MINUS           PIC 9(03) COMP-5 VALUE 45.         
       01 RAYLIB_KEY_PERIOD          PIC 9(03) COMP-5 VALUE 46.         
       01 RAYLIB_KEY_SLASH           PIC 9(03) COMP-5 VALUE 47.         
       01 RAYLIB_KEY_ZERO            PIC 9(03) COMP-5 VALUE 48.         
       01 RAYLIB_KEY_ONE             PIC 9(03) COMP-5 VALUE 49.         
       01 RAYLIB_KEY_TWO             PIC 9(03) COMP-5 VALUE 50.         
       01 RAYLIB_KEY_THREE           PIC 9(03) COMP-5 VALUE 51.         
       01 RAYLIB_KEY_FOUR            PIC 9(03) COMP-5 VALUE 52.         
       01 RAYLIB_KEY_FIVE            PIC 9(03) COMP-5 VALUE 53.         
       01 RAYLIB_KEY_SIX             PIC 9(03) COMP-5 VALUE 54.         
       01 RAYLIB_KEY_SEVEN           PIC 9(03) COMP-5 VALUE 55.         
       01 RAYLIB_KEY_EIGHT           PIC 9(03) COMP-5 VALUE 56.         
       01 RAYLIB_KEY_NINE            PIC 9(03) COMP-5 VALUE 57.         
       01 RAYLIB_KEY_SEMICOLON       PIC 9(03) COMP-5 VALUE 59.         
       01 RAYLIB_KEY_EQUAL           PIC 9(03) COMP-5 VALUE 61.         
       01 RAYLIB_KEY_A               PIC 9(03) COMP-5 VALUE 65.         
       01 RAYLIB_KEY_B               PIC 9(03) COMP-5 VALUE 66.         
       01 RAYLIB_KEY_C               PIC 9(03) COMP-5 VALUE 67.         
       01 RAYLIB_KEY_D               PIC 9(03) COMP-5 VALUE 68.         
       01 RAYLIB_KEY_E               PIC 9(03) COMP-5 VALUE 69.         
       01 RAYLIB_KEY_F               PIC 9(03) COMP-5 VALUE 70.         
       01 RAYLIB_KEY_G               PIC 9(03) COMP-5 VALUE 71.         
       01 RAYLIB_KEY_H               PIC 9(03) COMP-5 VALUE 72.         
       01 RAYLIB_KEY_I               PIC 9(03) COMP-5 VALUE 73.         
       01 RAYLIB_KEY_J               PIC 9(03) COMP-5 VALUE 74.         
       01 RAYLIB_KEY_K               PIC 9(03) COMP-5 VALUE 75.         
       01 RAYLIB_KEY_L               PIC 9(03) COMP-5 VALUE 76.         
       01 RAYLIB_KEY_M               PIC 9(03) COMP-5 VALUE 77.         
       01 RAYLIB_KEY_N               PIC 9(03) COMP-5 VALUE 78.         
       01 RAYLIB_KEY_O               PIC 9(03) COMP-5 VALUE 79.         
       01 RAYLIB_KEY_P               PIC 9(03) COMP-5 VALUE 80.         
       01 RAYLIB_KEY_Q               PIC 9(03) COMP-5 VALUE 81.         
       01 RAYLIB_KEY_R               PIC 9(03) COMP-5 VALUE 82.         
       01 RAYLIB_KEY_S               PIC 9(03) COMP-5 VALUE 83.         
       01 RAYLIB_KEY_T               PIC 9(03) COMP-5 VALUE 84.         
       01 RAYLIB_KEY_U               PIC 9(03) COMP-5 VALUE 85.         
       01 RAYLIB_KEY_V               PIC 9(03) COMP-5 VALUE 86.         
       01 RAYLIB_KEY_W               PIC 9(03) COMP-5 VALUE 87.         
       01 RAYLIB_KEY_X               PIC 9(03) COMP-5 VALUE 88.         
       01 RAYLIB_KEY_Y               PIC 9(03) COMP-5 VALUE 89.         
       01 RAYLIB_KEY_Z               PIC 9(03) COMP-5 VALUE 90.         
       01 RAYLIB_KEY_LEFT_BRACKET    PIC 9(03) COMP-5 VALUE 91.         
       01 RAYLIB_KEY_BACKSLASH       PIC 9(03) COMP-5 VALUE 92.         
       01 RAYLIB_KEY_RIGHT_BRACKET   PIC 9(03) COMP-5 VALUE 93.         
       01 RAYLIB_KEY_GRAVE           PIC 9(03) COMP-5 VALUE 96.         
       01 RAYLIB_KEY_SPACE           PIC 9(03) COMP-5 VALUE 32.         
       01 RAYLIB_KEY_ESCAPE          PIC 9(03) COMP-5 VALUE 256.        
       01 RAYLIB_KEY_ENTER           PIC 9(03) COMP-5 VALUE 257.        
       01 RAYLIB_KEY_TAB             PIC 9(03) COMP-5 VALUE 258.        
       01 RAYLIB_KEY_BACKSPACE       PIC 9(03) COMP-5 VALUE 259.        
       01 RAYLIB_KEY_INSERT          PIC 9(03) COMP-5 VALUE 260.        
       01 RAYLIB_KEY_DELETE          PIC 9(03) COMP-5 VALUE 261.        
       01 RAYLIB_KEY_RIGHT           PIC 9(03) COMP-5 VALUE 262.        
       01 RAYLIB_KEY_LEFT            PIC 9(03) COMP-5 VALUE 263.        
       01 RAYLIB_KEY_DOWN            PIC 9(03) COMP-5 VALUE 264.        
       01 RAYLIB_KEY_UP              PIC 9(03) COMP-5 VALUE 265.        
       01 RAYLIB_KEY_PAGE_UP         PIC 9(03) COMP-5 VALUE 266.        
       01 RAYLIB_KEY_PAGE_DOWN       PIC 9(03) COMP-5 VALUE 267.        
       01 RAYLIB_KEY_HOME            PIC 9(03) COMP-5 VALUE 268.        
       01 RAYLIB_KEY_END             PIC 9(03) COMP-5 VALUE 269.        
       01 RAYLIB_KEY_CAPS_LOCK       PIC 9(03) COMP-5 VALUE 280.        
       01 RAYLIB_KEY_SCROLL_LOCK     PIC 9(03) COMP-5 VALUE 281.        
       01 RAYLIB_KEY_NUM_LOCK        PIC 9(03) COMP-5 VALUE 282.        
       01 RAYLIB_KEY_PRINT_SCREEN    PIC 9(03) COMP-5 VALUE 283.        
       01 RAYLIB_KEY_PAUSE           PIC 9(03) COMP-5 VALUE 284.        
       01 RAYLIB_KEY_F1              PIC 9(03) COMP-5 VALUE 290.        
       01 RAYLIB_KEY_F2              PIC 9(03) COMP-5 VALUE 291.        
       01 RAYLIB_KEY_F3              PIC 9(03) COMP-5 VALUE 292.        
       01 RAYLIB_KEY_F4              PIC 9(03) COMP-5 VALUE 293.        
       01 RAYLIB_KEY_F5              PIC 9(03) COMP-5 VALUE 294.        
       01 RAYLIB_KEY_F6              PIC 9(03) COMP-5 VALUE 295.        
       01 RAYLIB_KEY_F7              PIC 9(03) COMP-5 VALUE 296.        
       01 RAYLIB_KEY_F8              PIC 9(03) COMP-5 VALUE 297.        
       01 RAYLIB_KEY_F9              PIC 9(03) COMP-5 VALUE 298.        
       01 RAYLIB_KEY_F10             PIC 9(03) COMP-5 VALUE 299.        
       01 RAYLIB_KEY_F11             PIC 9(03) COMP-5 VALUE 300.        
       01 RAYLIB_KEY_F12             PIC 9(03) COMP-5 VALUE 301.        
       01 RAYLIB_KEY_LEFT_SHIFT      PIC 9(03) COMP-5 VALUE 340.        
       01 RAYLIB_KEY_LEFT_CONTROL    PIC 9(03) COMP-5 VALUE 341.        
       01 RAYLIB_KEY_LEFT_ALT        PIC 9(03) COMP-5 VALUE 342.        
       01 RAYLIB_KEY_LEFT_SPER       PIC 9(03) COMP-5 VALUE 343.        
       01 RAYLIB_KEY_RIGHT_SHIFT     PIC 9(03) COMP-5 VALUE 344.        
       01 RAYLIB_KEY_RIGHT_CONTROL   PIC 9(03) COMP-5 VALUE 345.        
       01 RAYLIB_KEY_RIGHT_ALT       PIC 9(03) COMP-5 VALUE 346.        
       01 RAYLIB_KEY_RIGHT_SPER       PIC 9(03) COMP-5 VALUE 347.       
       01 RAYLIB_KEY_KB_MENU         PIC 9(03) COMP-5 VALUE 348.        
       01 RAYLIB_KEY_KP_0            PIC 9(03) COMP-5 VALUE 320.        
       01 RAYLIB_KEY_KP_1            PIC 9(03) COMP-5 VALUE 321.        
       01 RAYLIB_KEY_KP_2            PIC 9(03) COMP-5 VALUE 322.        
       01 RAYLIB_KEY_KP_3            PIC 9(03) COMP-5 VALUE 323.        
       01 RAYLIB_KEY_KP_4            PIC 9(03) COMP-5 VALUE 324.        
       01 RAYLIB_KEY_KP_5            PIC 9(03) COMP-5 VALUE 325.        
       01 RAYLIB_KEY_KP_6            PIC 9(03) COMP-5 VALUE 326.        
       01 RAYLIB_KEY_KP_7            PIC 9(03) COMP-5 VALUE 327.        
       01 RAYLIB_KEY_KP_8            PIC 9(03) COMP-5 VALUE 328.        
       01 RAYLIB_KEY_KP_9            PIC 9(03) COMP-5 VALUE 329.        
       01 RAYLIB_KEY_KP_DECIMAL      PIC 9(03) COMP-5 VALUE 330.        
       01 RAYLIB_KEY_KP_DIVIDE       PIC 9(03) COMP-5 VALUE 331.        
       01 RAYLIB_KEY_KP_MULTIPLY     PIC 9(03) COMP-5 VALUE 332.        
       01 RAYLIB_KEY_KP_SUBTRACT     PIC 9(03) COMP-5 VALUE 333.        
       01 RAYLIB_KEY_KP_ADD          PIC 9(03) COMP-5 VALUE 334.        
       01 RAYLIB_KEY_KP_ENTER        PIC 9(03) COMP-5 VALUE 335.        
       01 RAYLIB_KEY_KP_EQUAL        PIC 9(03) COMP-5 VALUE 336.        
       01 RAYLIB_KEY_BACK            PIC 9(03) COMP-5 VALUE 4.          
       01 RAYLIB_KEY_MENU            PIC 9(03) COMP-5 VALUE 5.          
       01 RAYLIB_KEY_VOLUME_UP       PIC 9(03) COMP-5 VALUE 24.         
       01 RAYLIB_KEY_VOLUME_DOWN     PIC 9(03) COMP-5 VALUE 25.
            